2d-example/0/F
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                       |
|  \\    /   O peration     | Version:  v2312                               |
|   \\  /    A nd           | Website:  www.openfoam.com                    |
|    \\/     M anipulation  |                                               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      F;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0]; // TODO I just made it into acceleration, maybe should be fixed later

internalField   nonuniform List<vector>
400                                   // Number of cells
(
        (-2.1152566473961887 -2.1224292158603033 0.0)
        (-2.319917443533214 -2.5113288078418727 0.0)
        (-2.579441439508024 -2.795725737231528 0.0)
        (-2.9306218891292755 -2.961955239466554 0.0)
        (-3.2628014334741096 -2.7227163253329336 0.0)
        (-3.5934088417858554 -2.2708357836067803 0.0)
        (-4.031100429018071 -1.8493808377574967 0.0)
        (-4.212238655079373 -1.4506397349402036 0.0)
        (-3.530411969186712 -1.0515803689008747 0.0)
        (-3.0289670542759186 -0.755564168724663 0.0)
        (-2.7095586258711366 -0.6158633979605216 0.0)
        (-2.6655141081808136 -0.5348284663542587 0.0)
        (-2.4132010656442837 -0.41041891739644887 0.0)
        (-2.010965016757799 -0.21496050957926072 0.0)
        (-1.5436947029383299 -0.06250879573036805 0.0)
        (-1.1696907541013806 0.05752621319021922 0.0)
        (-0.8319111107683428 0.025129358778861688 0.0)
        (-0.5182224483935829 0.013545378314289147 0.0)
        (-0.2184201950684046 -0.006096541861118077 0.0)
        (-0.023579047638037753 -0.02060422300822129 0.0)
        (-2.272848196397157 -2.117956201489805 0.0)
        (-2.690910774511599 -2.6887917249029707 0.0)
        (-3.2928535479279146 -3.3021945237227612 0.0)
        (-3.5729385898470465 -3.3834594954712065 0.0)
        (-3.475139971750216 -2.852366589312013 0.0)
        (-3.381695125321393 -2.3167253376163535 0.0)
        (-4.220826961438645 -2.389603055644857 0.0)
        (-4.578493201640243 -2.16757508572084 0.0)
        (-4.1014475203914715 -1.6886568787374605 0.0)
        (-3.0669799727022276 -1.146416273166194 0.0)
        (-2.8282011640618983 -0.9662556014170941 0.0)
        (-3.0756024449036103 -1.00058627315857 0.0)
        (-2.9530673182562692 -0.8465879219431096 0.0)
        (-2.371027194715124 -0.6515302615245081 0.0)
        (-1.63072122749789 -0.40507544169948173 0.0)
        (-1.3352437814887197 -0.3222785558432457 0.0)
        (-1.049769825478105 -0.2892355735262573 0.0)
        (-0.6670679919146001 -0.3197531949913377 0.0)
        (-0.2612061488665338 -0.2705784950752059 0.0)
        (-0.011566572563936672 -0.19669679819901975 0.0)
        (-2.3946113353249454 -2.2395100609857184 0.0)
        (-3.0262734761521424 -3.017753033266782 0.0)
        (-3.6867898098604233 -3.6818229528939375 0.0)
        (-3.4972976804282485 -3.3179595086423648 0.0)
        (-2.9261432860589345 -2.5216009215376882 0.0)
        (-2.6585028456050734 -2.0243667427940437 0.0)
        (-3.5820241723731527 -2.3784182778570706 0.0)
        (-4.499470310527889 -2.5754036069875825 0.0)
        (-3.6535024216097947 -1.900100011505305 0.0)
        (-1.8608029109512259 -0.9111513587776279 0.0)
        (-1.8499027791411056 -0.8230866254986711 0.0)
        (-2.8739914622350877 -1.2585944048584672 0.0)
        (-3.042084616991545 -1.2949766495706279 0.0)
        (-2.174670479363359 -0.9146453302467481 0.0)
        (-1.2276351152726046 -0.5668462750423127 0.0)
        (-1.173577269014935 -0.592801112251153 0.0)
        (-1.1119044428114704 -0.7722854664421834 0.0)
        (-0.7575638110576051 -0.7602627974617735 0.0)
        (-0.2801041108362543 -0.5770826514417497 0.0)
        (0.018858125531582504 -0.43314073080826243 0.0)
        (-2.222512661583713 -2.2440406074751396 0.0)
        (-2.66896020670524 -2.8204486520504317 0.0)
        (-3.1024201564706466 -3.2733622515954672 0.0)
        (-2.7745612881646875 -2.7890721451761844 0.0)
        (-1.0585034952816854 -0.9593754087051607 0.0)
        (0.14970211772595743 0.1234080777587866 0.0)
        (-0.13432199954907897 -0.0997465422873568 0.0)
        (-0.286322875327758 -0.1931452381329849 0.0)
        (0.41809650800558606 0.260948850804532 0.0)
        (2.286227928959785 1.3275736295017617 0.0)
        (1.8442838474484793 1.0285529420489108 0.0)
        (0.26266736440843197 0.14330061696152635 0.0)
        (-0.3504639626876096 -0.19316065000409774 0.0)
        (-0.07281119360741184 -0.043050504011954566 0.0)
        (0.048838495360670586 0.031721792668643 0.0)
        (-0.47825521018652606 -0.35620099331546373 0.0)
        (-0.8283049515872847 -0.8015102763860695 0.0)
        (-0.6752100662126659 -0.9915842114505153 0.0)
        (-0.2607429329728639 -0.8449801371760584 0.0)
        (0.05042122035385366 -0.6171744019129215 0.0)
        (-1.6960655067718144 -2.060840839434481 0.0)
        (-1.8742748481249403 -2.2478563377272556 0.0)
        (-1.6891110715827733 -1.9724535227885587 0.0)
        (-0.5323407307573446 -0.5796403307696041 0.0)
        (2.10302066874739 2.1241987087093035 0.0)
        (5.141705863259835 4.705259821118101 0.0)
        (7.627670816303105 6.35492663848493 0.0)
        (9.000177531231861 6.9765575258254096 0.0)
        (10.014744701370985 7.244318509448344 0.0)
        (9.754859083061493 6.688887964343499 0.0)
        (8.969628137295047 6.052172091248627 0.0)
        (8.282900679120372 5.582388087160145 0.0)
        (6.516349757272356 4.489491768997397 0.0)
        (5.344421382642235 3.988560846527742 0.0)
        (2.8096021404746803 2.343452770371419 0.0)
        (0.8757354051585304 0.8712744676691628 0.0)
        (-0.18469764204214567 -0.23815751396336982 0.0)
        (-0.41068525002581624 -0.8320265461225864 0.0)
        (-0.20762465309630684 -0.8610620556713844 0.0)
...
);

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }
// WALLS
    fixedWalls {
        type zeroGradient;
    }
    frontAndBack {
        type empty;
    }

    coldEnd {
        type zeroGradient;
    }

    hotEnd {
        type zeroGradient;
    }
}

// ************************************************************************* //
