2d-example/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.143; //Value for water 

boundaryField
{
    // WALLS
    fixedWalls {
        type fixedValue;
        value uniform 0.143;
    }

    frontAndBack {
        type empty;
    }

    // INLET
    coldEnd {
        type zeroGradient;
    }

    // OUTLET
    hotEnd {
        type zeroGradient;
    }

}


// ************************************************************************* //
