2d-example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0) // 0
    (1 0 0) // 1
    (1 1 0) // 2
    (0 1 0) // 3
    (0 0 0.1) // 4
    (1 0 0.1) // 5
    (1 1 0.1) // 6
    (0 1 0.1) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (2 6 7 3)
            (1 5 4 0)
        );
    }
    hotEnd{
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    coldEnd{
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
